# FailureDefinitionAccessor Properties

---
The FailureDefinitionAccessor type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace